// System.Console.WriteLine("Input number: ");
// int num = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine($"{num} -> {num * num}");

// Напишите программу, которая на вход принимает два целых числа и проверяет, является ли первое число квадратом второго.

// System.Console.WriteLine("Input first number");
// int num1 = Convert.ToInt32(Console.ReadLine());
// System.Console.WriteLine("Input second number");
// int num2 = Convert.ToInt32(Console.ReadLine());
// if (num1 = num2 * num2)
// {
//     System.Console.WriteLine($"{num1} is quad of {num2}");

// }
// else
// {
//     System.Console.WriteLine($"{num1} is not quad of {num2}");
// }

// Напишите программу, которая на вход принимает целое число N, а на выходе показывает все целые числа в промежутке от -N до N.

// System.Console.WriteLine("Input N: ");
// int n = Convert.ToInt32(Console.ReadLine());
// for(int i = -n; i <= n; i++)
// {
//     System.Console.Write(i + " "));
// }

// Напишите программу, которая принимает на вход трёхзначное целое число и на выходе показывает сумму первой и последней цифры этого числа.

// System.Console.Write("Input number: ");
// int num = Convert.ToInt32(Console.ReadLine());
// int one = num / 100;
// int there = num % 10;
// if (num > 99 && num < 999)
// {
//     System.Console.WriteLine($"Sum = {one + there}");
// }
// else
// {
//     System.Console.WriteLine("Number not read");
// }

